Revit 2015 API
DirectShape.SetShape Method
Overload List
Name | Description
SetShape(IList<GeometryObject>)
 sets the Shape of this object to the supplied collection of Geometry objects. The objects are copied.
SetShape(IList<GeometryObject>, DirectShapeTargetViewType)
 sets the view-specific Shape of this object to the supplied collection of Geometry objects. The objects are copied.
See Also
DirectShape Class
DirectShape Members
Autodesk.Revit.DB Namespace